УТ/src/DataProcessors/CRM_Мессенджер/CRM_Мессенджер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_Мессенджер</name>
</mdclass:DataProcessor>

УТ/src/InformationRegisters/CRM_ВидыКонтактнойИнформацииМессенджеров/CRM_ВидыКонтактнойИнформацииМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ВидыКонтактнойИнформацииМессенджеров</name>
  <attributes>
    <name>ВидКИ_Клиент</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКИ_КЛ</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКИ_ПК</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКИ_Пользователь</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Documents/CRM_СообщениеМессенджера/CRM_СообщениеМессенджера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_СообщениеМессенджера</name>
  <posting>Deny</posting>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ID_Пользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_Сообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.CRM_ВидыСообщенияМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Диалог</name>
    <type>
      <types>CatalogRef.CRM_Диалоги</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отложенное</name>
    <comment>Признак запланированной отправки сообщения.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОснование</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

УТ/src/Catalogs/CRM_Диалоги/CRM_Диалоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_Диалоги</name>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>ID_Пользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.CRM_ЭтапКалендарногоПлана</types>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.CRM_РассылкаЭлектронныхПисем</types>
      <types>DocumentRef.CRM_Взаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.CRM_УстановкаИспользуемыхПоказателей</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.CRM_Телемаркетинг</types>
      <types>DocumentRef.СогласиеНаОбработкуПерсональныхДанных</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.СправкиСПАРКРиски</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.ОтзывСогласияНаОбработкуПерсональныхДанных</types>
      <types>CatalogRef.Партнеры</types>
      <types>DocumentRef.Анкета</types>
      <types>DocumentRef.НазначениеОпросов</types>
      <types>DocumentRef.КоммерческоеПредложениеКлиенту</types>
      <types>DocumentRef.СообщениеSMS</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>DocumentRef.CRM_ПланированиеВоронкиПродаж</types>
      <types>DocumentRef.CRM_ОтчетОРаботе</types>
      <types>DocumentRef.CRM_ОтсутствиеСотрудника</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
      <types>DocumentRef.CRM_ШаблонЭтапаКалендарногоПлана</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.CRM_СтатусыДиалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействияСДиалогом</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.CRM_ДействияСДиалогами</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектДействия</name>
      <type>
        <types>DocumentRef.CRM_Интерес</types>
        <types>TaskRef.ЗадачаИсполнителя</types>
        <types>CatalogRef.Пользователи</types>
        <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/CRM_УчетныеЗаписиМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УчетныеЗаписиМессенджеров</name>
  <predefined>
    <items>
      <name>B2BПортал</name>
      <description>B2B портал</description>
    </items>
    <items>
      <name>СистемаВзаимодействия</name>
      <description>Система взаимодействия</description>
    </items>
  </predefined>
  <attributes>
    <name>CRM_ВариантАвтосозданияКлиентов</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>EnumRef.CRM_ВариантыАвтосозданияКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерГруппа</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерСтатусРаботы</name>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СоздаватьПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокЖизниОбращения</name>
    <comment>Время жизни обращения (дней)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Включена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWebhook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодWebhook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПросмотрСообщенийВсемПользователям</name>
    <comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияИспользованияПриняты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметровДоступа</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Сценарии</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/DataProcessors/CRM_Мессенджер/Forms/ФормаВыбораПолучателя/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Канал") Тогда
		Канал = Параметры.Канал;
	КонецЕсли;
	Если Параметры.Свойство("Пользователь") Тогда
		Пользователь = Параметры.Пользователь;
	КонецЕсли;
	Если Параметры.Свойство("РолиПользователя") Тогда
		РолиПользователя = Параметры.РолиПользователя;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	Если Не ЗначениеЗаполнено(ВидПолучателя) Тогда
		ВидПолучателя = "Клиенты";
	КонецЕсли;
	ВидПолучателяПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ВидПолучателяПриИзмененииНаСервере()
	Если ВидПолучателя = "Клиенты" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКлиенты;
	ИначеЕсли ВидПолучателя = "ПотенциальныеКлиенты" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПК;
	ИначеЕсли ВидПолучателя = "Пользователи" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПользователи;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПолучателяПриИзменении(Элемент)
	ВидПолучателяПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДСПриАктивизацииСтроки(Элемент)
	ЗаполнитьДеревоКИ(Элемент.ТекущаяСтрока);
	РазвернутьСтрокиДереваКИ();
КонецПроцедуры


&НаСервере
Функция ДеревоКИВыборНаСервере(Контакт, УчетнаяЗапись, ТипМессенджера, ПредставлениеКИ, ЗначениеКИ)
	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(ТипМессенджера);
	ПараметрыМессенджера = МодульМенеджера.ПараметрыМессенджера();
	ТипКИ = МодульМенеджера.ТипКИМессенджера();
	
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		idПолучателя = CRM_УправлениеКонтактнойИнформацией.НомерТелефонаПоЗначениюКИ(ЗначениеКИ, ТипКИ);
	Иначе
		idПолучателя = СтрЗаменить(ПредставлениеКИ, МодульМенеджера.НачалоАдресаСтраницыПользователя(), "");
	КонецЕсли;
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("ID_Пользователя", idПолучателя);
	ПараметрыДиалога.Вставить("Группа", idПолучателя);
	ПараметрыДиалога.Вставить("ГруппаПредставление", "");
	ПараметрыДиалога.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыДиалога.Вставить("Контакт", Контакт);
	ПараметрыДиалога.Вставить("КонтактПредставление", Контакт.Наименование);
	ПараметрыДиалога.Вставить("Ответственный", Пользователь);

	Если ПараметрыМессенджера.ВозможностьПисатьПервыми Тогда
		Если УчетнаяЗапись.ТипМессенджера = "WhatsApp" Тогда
			ПараметрыДиалога.Вставить("ЭтоНомерТелефона", Истина);
		КонецЕсли;
		Диалог = Справочники.CRM_Диалоги.ПолучитьАктивныйДиалог(ПараметрыДиалога);
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	CRM_Диалоги.Ссылка КАК Ссылка,
			|	ВЫБОР
			|		КОГДА CRM_Диалоги.Статус = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДиалогов.Закрыт)
			|			ТОГДА 10
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК Порядок,
			|	CRM_Диалоги.Статус <> ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДиалогов.Закрыт) КАК Активный,
			|	CRM_Диалоги.Группа КАК Группа,
			|	CRM_Диалоги.ГруппаПредставление КАК ГруппаПредставление
			|ИЗ
			|	Справочник.CRM_Диалоги КАК CRM_Диалоги
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
			|		ПО CRM_Диалоги.Ссылка = CRM_СообщениеМессенджера.Диалог
			|ГДЕ
			|	CRM_Диалоги.ID_Пользователя = &ID_Пользователя
			|	И CRM_Диалоги.УчетнаяЗапись = &УчетнаяЗапись
			|	И CRM_Диалоги.Контакт = &Контакт
			|	И НЕ CRM_Диалоги.Служебный
			|	И НЕ CRM_СообщениеМессенджера.Ссылка = ЗНАЧЕНИЕ(Документ.CRM_СообщениеМессенджера.ПустаяСсылка)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Порядок");
		
		Запрос.УстановитьПараметр("ID_Пользователя", idПолучателя);
		Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
		Запрос.УстановитьПараметр("Контакт", Контакт);

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Активный Тогда
				Диалог = Выборка.Ссылка;
			Иначе
				ПараметрыДиалога.Вставить("Группа", Выборка.Группа);
				ПараметрыДиалога.Вставить("ГруппаПредставление", Выборка.ГруппаПредставление);
				Диалог = Справочники.CRM_Диалоги.ПолучитьАктивныйДиалог(ПараметрыДиалога);
			КонецЕсли;
		Иначе
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В данный мессенджер нельзя писать первыми!
			                                           |С указанным контактом не было диалогов.'"));
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Диалог;
	
КонецФункции

&НаКлиенте
Процедура ДеревоКИВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВидКИ) Тогда
		Возврат;
	КонецЕсли;
	ДанныеКИ = Элемент.ТекущиеДанные;
	Диалог = ДеревоКИВыборНаСервере(ДанныеКИ.Контакт, ДанныеКИ.Значение, ДанныеКИ.ТипМессенджера,
		ДанныеКИ.ПредставлениеКИ, ДанныеКИ.ЗначениеКИ);
		
	Если Диалог <> Неопределено Тогда
		Закрыть(Диалог);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоКИ(Ссылка)

	ДеревоКИ.ПолучитьЭлементы().Очистить();
	
	Если Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДЗ = РеквизитФормыВЗначение("ДеревоКИ");
	
	ТипСсылки = ТипЗнч(Ссылка);
	Если ТипСсылки = Тип("СправочникСсылка.Партнеры") Тогда
		Запрос = ЗапросДеревоКИ_Партнеры(Ссылка);
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		Запрос = ЗапросДеревоКИ_ПК(Ссылка);
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.Пользователи") Тогда
		Запрос = ЗапросДеревоКИ_Пользователи(Ссылка);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("РолиПользователя", РолиПользователя);
	
	ВыборкаКонтакт = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКонтакт.Следующий() Цикл
		Если ВыборкаКонтакт.Контакт <> Ссылка Тогда
			СтрокаКонтакт = ДЗ.Строки.Добавить();
			СтрокаКонтакт.Значение = ВыборкаКонтакт.Контакт;
			СтрокаКонтакт.Иконка = 99;
			СтрокиКИ = СтрокаКонтакт.Строки;
		Иначе
			СтрокиКИ = ДЗ.Строки;
		КонецЕсли;
		
		ВыборкаКИ = ВыборкаКонтакт.Выбрать();
		Пока ВыборкаКИ.Следующий() Цикл
			СтрокаКИ = СтрокиКИ.Добавить();
			СтрокаКИ.Значение = ВыборкаКИ.УчетнаяЗапись;
			СтрокаКИ.ВидКИ = ВыборкаКИ.Вид;
			СтрокаКИ.Контакт = ВыборкаКИ.Контакт;
			СтрокаКИ.ПредставлениеКИ = ВыборкаКИ.Представление;
			СтрокаКИ.ЗначениеКИ = ВыборкаКИ.Значение;
			СтрокаКИ.ТипМессенджера = ВыборкаКИ.ТипМессенджера;
			СтрокаКИ.Иконка = ВыборкаКИ.Иконка;
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДЗ, "ДеревоКИ");
	
КонецПроцедуры

&НаСервере
Функция ЗапросДеревоКИ_Партнеры(Ссылка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КонтактнаяИнформация.Ссылка КАК Контакт,
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.Значение КАК Значение,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	CRM_УчетныеЗаписиМессенджеров.Ссылка КАК УчетнаяЗапись,
	|	CRM_УчетныеЗаписиМессенджеров.ТипМессенджера КАК ТипМессенджера,
	|	ВЫБОР
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""ВКонтакте""
	|			ТОГДА 1
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""InstagramDirect""
	|			ТОГДА 2
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Telegram""
	|			ТОГДА 3
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""WhatsApp""
	|			ТОГДА 4
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Facebook""
	|			ТОГДА 5
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Viber""
	|			ТОГДА 6
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Instagram""
	|			ТОГДА 7
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""ВКонтактеКомментарии""
	|			ТОГДА 8
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""СистемаВзаимодействия""
	|			ТОГДА 9
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""TelegramBot""
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Иконка
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ВидыКонтактнойИнформацииМессенджеров КАК CRM_ВидыКонтактнойИнформацииМессенджеров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_УчетныеЗаписиМессенджеров КАК НастройкиУчетныхЗаписей
	|				ПО (НастройкиУчетныхЗаписей.УчетнаяЗапись = CRM_УчетныеЗаписиМессенджеров.Ссылка)
	|					И (НастройкиУчетныхЗаписей.Пользователь = &Пользователь
	|						ИЛИ НастройкиУчетныхЗаписей.Пользователь В (&РолиПользователя)
	|						ИЛИ CRM_УчетныеЗаписиМессенджеров.РазрешитьПросмотрСообщенийВсемПользователям)
	|			ПО CRM_ВидыКонтактнойИнформацииМессенджеров.ТипМессенджера = CRM_УчетныеЗаписиМессенджеров.ТипМессенджера
	|				И CRM_УчетныеЗаписиМессенджеров.Включена
	|				И  НЕ CRM_УчетныеЗаписиМессенджеров.ПометкаУдаления
	|		ПО КонтактнаяИнформация.Вид = CRM_ВидыКонтактнойИнформацииМессенджеров.ВидКИ_Клиент
	|			И (КонтактнаяИнформация.Представление <> """")
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Ссылка,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Значение,
	|	КонтактнаяИнформация.Вид,
	|	CRM_УчетныеЗаписиМессенджеров.Ссылка,
	|	CRM_УчетныеЗаписиМессенджеров.ТипМессенджера,
	|	ВЫБОР
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""ВКонтакте""
	|			ТОГДА 1
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""InstagramDirect""
	|			ТОГДА 2
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Telegram""
	|			ТОГДА 3
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""WhatsApp""
	|			ТОГДА 4
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Facebook""
	|			ТОГДА 5
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Viber""
	|			ТОГДА 6
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Instagram""
	|			ТОГДА 7
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""ВКонтактеКомментарии""
	|			ТОГДА 8
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""СистемаВзаимодействия""
	|			ТОГДА 9
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""TelegramBot""
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Иконка
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ВидыКонтактнойИнформацииМессенджеров КАК CRM_ВидыКонтактнойИнформацииМессенджеров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_УчетныеЗаписиМессенджеров КАК НастройкиУчетныхЗаписей
	|				ПО (НастройкиУчетныхЗаписей.УчетнаяЗапись = CRM_УчетныеЗаписиМессенджеров.Ссылка)
	|					И (НастройкиУчетныхЗаписей.Пользователь = &Пользователь
	|						ИЛИ НастройкиУчетныхЗаписей.Пользователь В (&РолиПользователя)
	|						ИЛИ CRM_УчетныеЗаписиМессенджеров.РазрешитьПросмотрСообщенийВсемПользователям)
	|			ПО CRM_ВидыКонтактнойИнформацииМессенджеров.ТипМессенджера = CRM_УчетныеЗаписиМессенджеров.ТипМессенджера
	|				И CRM_УчетныеЗаписиМессенджеров.Включена
	|				И  НЕ CRM_УчетныеЗаписиМессенджеров.ПометкаУдаления
	|		ПО КонтактнаяИнформация.Вид = CRM_ВидыКонтактнойИнформацииМессенджеров.ВидКИ_КЛ
	|			И (КонтактнаяИнформация.Представление <> """")
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка.Владелец = &Ссылка
	|ИТОГИ ПО
	|	Контакт");
	
	Возврат Запрос;
КонецФункции

&НаСервере
Функция ЗапросДеревоКИ_ПК(Ссылка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КонтактнаяИнформация.Ссылка КАК Контакт,
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.Значение КАК Значение,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	CRM_УчетныеЗаписиМессенджеров.Ссылка КАК УчетнаяЗапись,
	|	CRM_УчетныеЗаписиМессенджеров.ТипМессенджера КАК ТипМессенджера,
	|	ВЫБОР
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""ВКонтакте""
	|			ТОГДА 1
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""InstagramDirect""
	|			ТОГДА 2
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Telegram""
	|			ТОГДА 3
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""WhatsApp""
	|			ТОГДА 4
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Facebook""
	|			ТОГДА 5
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Viber""
	|			ТОГДА 6
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Instagram""
	|			ТОГДА 7
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""ВКонтактеКомментарии""
	|			ТОГДА 8
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""СистемаВзаимодействия""
	|			ТОГДА 9
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""TelegramBot""
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Иконка
	|ИЗ
	|	Справочник.CRM_ПотенциальныеКлиенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ВидыКонтактнойИнформацииМессенджеров КАК CRM_ВидыКонтактнойИнформацииМессенджеров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_УчетныеЗаписиМессенджеров КАК НастройкиУчетныхЗаписей
	|				ПО (НастройкиУчетныхЗаписей.УчетнаяЗапись = CRM_УчетныеЗаписиМессенджеров.Ссылка)
	|					И (НастройкиУчетныхЗаписей.Пользователь = &Пользователь
	|						ИЛИ НастройкиУчетныхЗаписей.Пользователь В (&РолиПользователя)
	|						ИЛИ CRM_УчетныеЗаписиМессенджеров.РазрешитьПросмотрСообщенийВсемПользователям)
	|			ПО CRM_ВидыКонтактнойИнформацииМессенджеров.ТипМессенджера = CRM_УчетныеЗаписиМессенджеров.ТипМессенджера
	|				И CRM_УчетныеЗаписиМессенджеров.Включена
	|				И  НЕ CRM_УчетныеЗаписиМессенджеров.ПометкаУдаления
	|		ПО КонтактнаяИнформация.Вид = CRM_ВидыКонтактнойИнформацииМессенджеров.ВидКИ_ПК
	|			И (КонтактнаяИнформация.Представление <> """")
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Контакт");
	Возврат Запрос;
	
КонецФункции

&НаСервере
Функция ЗапросДеревоКИ_Пользователи(Ссылка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КонтактнаяИнформация.Ссылка КАК Контакт,
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.Значение КАК Значение,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	CRM_УчетныеЗаписиМессенджеров.Ссылка КАК УчетнаяЗапись,
	|	CRM_УчетныеЗаписиМессенджеров.ТипМессенджера КАК ТипМессенджера,
	|	ВЫБОР
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""ВКонтакте""
	|			ТОГДА 1
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""InstagramDirect""
	|			ТОГДА 2
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Telegram""
	|			ТОГДА 3
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""WhatsApp""
	|			ТОГДА 4
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Facebook""
	|			ТОГДА 5
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Viber""
	|			ТОГДА 6
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""Instagram""
	|			ТОГДА 7
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""ВКонтактеКомментарии""
	|			ТОГДА 8
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""СистемаВзаимодействия""
	|			ТОГДА 9
	|		КОГДА CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""TelegramBot""
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Иконка
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ВидыКонтактнойИнформацииМессенджеров КАК CRM_ВидыКонтактнойИнформацииМессенджеров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_УчетныеЗаписиМессенджеров КАК НастройкиУчетныхЗаписей
	|				ПО (НастройкиУчетныхЗаписей.УчетнаяЗапись = CRM_УчетныеЗаписиМессенджеров.Ссылка)
	|					И (НастройкиУчетныхЗаписей.Пользователь = &Пользователь
	|						ИЛИ НастройкиУчетныхЗаписей.Пользователь В (&РолиПользователя)
	|						ИЛИ CRM_УчетныеЗаписиМессенджеров.РазрешитьПросмотрСообщенийВсемПользователям)
	|			ПО CRM_ВидыКонтактнойИнформацииМессенджеров.ТипМессенджера = CRM_УчетныеЗаписиМессенджеров.ТипМессенджера
	|				И CRM_УчетныеЗаписиМессенджеров.Включена
	|				И  НЕ CRM_УчетныеЗаписиМессенджеров.ПометкаУдаления
	|		ПО КонтактнаяИнформация.Вид = CRM_ВидыКонтактнойИнформацииМессенджеров.ВидКИ_Пользователь
	|			И (КонтактнаяИнформация.Представление <> """")
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Контакт");
	Возврат Запрос;
	
КонецФункции

&НаКлиенте
Процедура РазвернутьСтрокиДереваКИ()
	
	СтрокиДерева = ЭтотОбъект.ДеревоКИ.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Элементы.ДеревоКИ.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
